#### SpecificHeat Property

---

|  |
| --- |
| ThermalAsset Class   See Also |

The specific heat of the asset.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public double SpecificHeat { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property SpecificHeat As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double SpecificHeat { 	double get (); 	void set (double value); } ``` |

# Remarks

Values are in squared-feet per Kelvin, squared-second (ftÂ²/(K Â· sÂ²)) and must be non-negative.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: The given value for specificHeat must be non-negative. |

# See Also

ThermalAsset Class

Autodesk.Revit.DB Namespace